pnt325/EFR32BG22-Thunerboard-ICM20648-DMP-QUATER_6/base_project_thunderboard_mcu/gecko_sdk_4.1.1/hardware/driver/icm20648/src/sl_icm20648.c
  /* Disable all sensors */
  sl_icm20648_enable_sensor(false, false, false);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads the temperature sensor raw value and converts to Celsius.
 ******************************************************************************/
sl_status_t sl_icm20648_read_temperature_data(float *temperature)
{
  uint8_t data[2];
  int16_t raw_temp;

  /* Read temperature registers */
  sl_icm20648_read_register(ICM20648_REG_TEMPERATURE_H, 2, data);

  /* Convert to int16 */
  raw_temp = (int16_t) ( (data[0] << 8) + data[1]);

  /* Calculate the Celsius value from the raw reading */
  *temperature = ( (float) raw_temp / 333.87) + 21.0;

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads the device ID of the ICM20648
 ******************************************************************************/
sl_status_t sl_icm20648_get_device_id(uint8_t *devID)
{
  sl_icm20648_read_register(ICM20648_REG_WHO_AM_I, 1, devID);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Initializes the SPI bus in order to communicate with the ICM20648
 ******************************************************************************/
sl_status_t sl_icm20648_spi_init(void)
{
  USART_TypeDef *usart = SL_ICM20648_SPI_PERIPHERAL;

  USART_InitSync_TypeDef init = USART_INITSYNC_DEFAULT;
  init.msbf = true;           // Send most significant byte first
  init.baudrate = 5000000;    // SPI-frequency at 3.3 MHz

  /* Enabling clock to USART */
#if defined(_SILICON_LABS_32B_SERIES_2)
  CMU_ClockEnable(cmuClock_PCLK, true);
#else
  CMU_ClockEnable(cmuClock_HFPER, true);
#endif
  CMU_ClockEnable(ICM20648_SPI_CLK(SL_ICM20648_SPI_PERIPHERAL_NO), true);
  CMU_ClockEnable(cmuClock_GPIO, true);

  /* IO configuration */
  GPIO_PinModeSet(SL_ICM20648_SPI_TX_PORT, SL_ICM20648_SPI_TX_PIN, gpioModePushPull, 0);    /* TX - MOSI */
  GPIO_PinModeSet(SL_ICM20648_SPI_RX_PORT, SL_ICM20648_SPI_RX_PIN, gpioModeInput, 0);    /* RX - MISO */
  GPIO_PinModeSet(SL_ICM20648_SPI_CLK_PORT, SL_ICM20648_SPI_CLK_PIN, gpioModePushPull, 0);    /* Clock */
  GPIO_PinModeSet(SL_ICM20648_SPI_CS_PORT, SL_ICM20648_SPI_CS_PIN, gpioModePushPull, 1);     /* CS */

  USART_Reset(SL_ICM20648_SPI_PERIPHERAL);

  /* Initialize USART, in SPI master mode. */
  USART_InitSync(usart, &init);

  /* Enable pins at correct UART/USART location. */
#if defined(_SILICON_LABS_32B_SERIES_2)
  GPIO->USARTROUTE[SL_ICM20648_SPI_PERIPHERAL_NO].ROUTEEN = GPIO_USART_ROUTEEN_RXPEN | GPIO_USART_ROUTEEN_TXPEN | GPIO_USART_ROUTEEN_CLKPEN;
  GPIO->USARTROUTE[SL_ICM20648_SPI_PERIPHERAL_NO].TXROUTE |= ((SL_ICM20648_SPI_TX_PORT << _GPIO_USART_TXROUTE_PORT_SHIFT) | (SL_ICM20648_SPI_TX_PIN << _GPIO_USART_TXROUTE_PIN_SHIFT));
  GPIO->USARTROUTE[SL_ICM20648_SPI_PERIPHERAL_NO].RXROUTE |= ((SL_ICM20648_SPI_RX_PORT << _GPIO_USART_RXROUTE_PORT_SHIFT) | (SL_ICM20648_SPI_RX_PIN << _GPIO_USART_RXROUTE_PIN_SHIFT));
  GPIO->USARTROUTE[SL_ICM20648_SPI_PERIPHERAL_NO].CLKROUTE |= ((SL_ICM20648_SPI_CLK_PORT << _GPIO_USART_CLKROUTE_PORT_SHIFT) | (SL_ICM20648_SPI_CLK_PIN << _GPIO_USART_CLKROUTE_PIN_SHIFT));
#else
  usart->ROUTEPEN   = USART_ROUTEPEN_RXPEN | USART_ROUTEPEN_TXPEN | USART_ROUTEPEN_CLKPEN;
  usart->ROUTELOC0  = (usart->ROUTELOC0 & ~(_USART_ROUTELOC0_TXLOC_MASK | _USART_ROUTELOC0_RXLOC_MASK | _USART_ROUTELOC0_CLKLOC_MASK) );
  usart->ROUTELOC0 |= (SL_ICM20648_SPI_TX_LOC << _USART_ROUTELOC0_TXLOC_SHIFT);
  usart->ROUTELOC0 |= (SL_ICM20648_SPI_RX_LOC << _USART_ROUTELOC0_RXLOC_SHIFT);
  usart->ROUTELOC0 |= (SL_ICM20648_SPI_CLK_LOC << _USART_ROUTELOC0_CLKLOC_SHIFT);
#endif

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads register from the ICM20648 device
 ******************************************************************************/
void sl_icm20648_read_register(uint16_t addr, int numBytes, uint8_t *data)
{
  uint8_t regAddr;
  uint8_t bank;

  regAddr = (uint8_t) (addr & 0x7F);
  bank = (uint8_t) (addr >> 7);

  sl_icm20648_select_register_bank(bank);

  /* Enable chip select */
  sl_icm20648_chip_select_set(true);

  /* Set R/W bit to 1 - read */
  USART_Tx(SL_ICM20648_SPI_PERIPHERAL, (regAddr | 0x80) );
  USART_Rx(SL_ICM20648_SPI_PERIPHERAL);
  /* Transmit 0's to provide clock and read the data */
  while ( numBytes-- ) {
    USART_Tx(SL_ICM20648_SPI_PERIPHERAL, 0x00);
    *data++ = USART_Rx(SL_ICM20648_SPI_PERIPHERAL);
  }

  /* Disable chip select */
  sl_icm20648_chip_select_set(false);
}

/***************************************************************************//**
 *    Writes a register in the ICM20648 device
 ******************************************************************************/
void sl_icm20648_write_register(uint16_t addr, uint8_t data)
{
  uint8_t regAddr;
  uint8_t bank;

  regAddr = (uint8_t) (addr & 0x7F);
  bank = (uint8_t) (addr >> 7);

  sl_icm20648_select_register_bank(bank);

  /* Enable chip select */
  sl_icm20648_chip_select_set(true);

  /* clear R/W bit - write, send the address */
  USART_Tx(SL_ICM20648_SPI_PERIPHERAL, (regAddr & 0x7F) );
  USART_Rx(SL_ICM20648_SPI_PERIPHERAL);

  /* Send the data */
  USART_Tx(SL_ICM20648_SPI_PERIPHERAL, data);
  USART_Rx(SL_ICM20648_SPI_PERIPHERAL);

  /* Disable chip select */
  sl_icm20648_chip_select_set(false);
}

/***************************************************************************//**
 *    Select the desired register bank
 ******************************************************************************/
void sl_icm20648_select_register_bank(uint8_t bank)
{
  /* Enable chip select */
  sl_icm20648_chip_select_set(true);

  /* Select the Bank Select register */
  USART_Tx(SL_ICM20648_SPI_PERIPHERAL, ICM20648_REG_BANK_SEL);
  USART_Rx(SL_ICM20648_SPI_PERIPHERAL);

  /* Write the desired bank address 0..3 */
  USART_Tx(SL_ICM20648_SPI_PERIPHERAL, (bank << 4) );
  USART_Rx(SL_ICM20648_SPI_PERIPHERAL);

  /* Disable chip select */
  sl_icm20648_chip_select_set(false);
}

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/***************************************************************************//**
 * @brief
 *    Controls the state of the ICM20648 SPI chip select pin
 *
 * @param[in] select
 *    The desired state of the select pin. True: asserted (logic L)
 *
 * @return
 *    None
 ******************************************************************************/
void sl_icm20648_chip_select_set(bool select)
{
  if ( select ) {
    GPIO_PinOutClear(SL_ICM20648_SPI_CS_PORT, SL_ICM20648_SPI_CS_PIN);
  } else {
    GPIO_PinOutSet(SL_ICM20648_SPI_CS_PORT, SL_ICM20648_SPI_CS_PIN);
  }
}

/** @endcond */
